In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
dict1={
       "name":["harry","SLS","SS","Ram"],
       "marks":[28,100,85,40],
       "city":["Bhkt","Ktm","Ptn","Ktm"]
    }

In [4]:
dict1

{'name': ['harry', 'SLS', 'SS', 'Ram'],
 'marks': [28, 100, 85, 40],
 'city': ['Bhkt', 'Ktm', 'Ptn', 'Ktm']}

In [5]:
df1=pd.DataFrame(dict1)

In [6]:
df1

    name  marks  city
0  harry     28  Bhkt
1    SLS    100   Ktm
2     SS     85   Ptn
3    Ram     40   Ktm

In [7]:
df1.to_csv('student_marks.csv')

In [8]:
df1.to_csv('student_marks_false_index.csv', index=False)

In [9]:
df1.head(1)

    name  marks  city
0  harry     28  Bhkt

In [10]:
df1.head(2)

    name  marks  city
0  harry     28  Bhkt
1    SLS    100   Ktm

In [11]:
df1.tail(1)

  name  marks city
3  Ram     40  Ktm

In [12]:
df1.describe()

            marks
count    4.000000
mean    63.250000
std     34.673477
min     28.000000
25%     37.000000
50%     62.500000
75%     88.750000
max    100.000000

In [13]:
df1

    name  marks  city
0  harry     28  Bhkt
1    SLS    100   Ktm
2     SS     85   Ptn
3    Ram     40   Ktm

In [14]:
df1['name']

0    harry
1      SLS
2       SS
3      Ram
Name: name, dtype: object

In [15]:
df1['name'][0]

'harry'

In [16]:
df1.index=['*','*','*','*']

In [17]:
df1

    name  marks  city
*  harry     28  Bhkt
*    SLS    100   Ktm
*     SS     85   Ptn
*    Ram     40   Ktm

In [18]:
df1.index=['first','second','third','fourth']

In [19]:
df1

         name  marks  city
first   harry     28  Bhkt
second    SLS    100   Ktm
third      SS     85   Ptn
fourth    Ram     40   Ktm

# Python has two types of data strutures
1) Series : One dimensional Array with indexes, it stores a single column or row of data in a Dataframe
2) DataFrame : It's a tabular spreadsheet like structure representing rows each of which contains one or multiple coln.2D data

In [20]:
np.random.rand(5)

array([0.72532713, 0.9023867 , 0.95075839, 0.73316181, 0.40258564])

In [21]:
ser=pd.Series(np.random.rand(5))

In [22]:
ser

0    0.820352
1    0.143725
2    0.949803
3    0.395534
4    0.992976
dtype: float64

In [23]:
type(ser)

pandas.core.series.Series

In [24]:
newdf = pd.DataFrame(np.random.rand(334,5))

In [25]:
newdf

            0         1         2         3         4
0    0.705412  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [26]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.502345    0.496661    0.506156    0.476980    0.504103
std      0.279543    0.286260    0.292958    0.282767    0.284546
min      0.001929    0.002412    0.001733    0.001378    0.001366
25%      0.253619    0.256201    0.265697    0.228968    0.268639
50%      0.508841    0.481548    0.486047    0.468646    0.517039
75%      0.729649    0.755025    0.772074    0.704203    0.740205
max      0.999839    0.994486    0.999686    0.998864    0.996425

In [27]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
newdf[0][0]='SLS'

In [29]:
newdf

            0         1         2         3         4
0         SLS  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [30]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newdf.index

RangeIndex(start=0, stop=334, step=1)

In [32]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [33]:
newdf

            0         1         2         3         4
0         SLS  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [34]:
#Converting into Numpy Array
newdf.to_numpy()

array([['SLS', 0.02899971711754845, 0.6562064172638539,
        0.48125445369208164, 0.7293626230241204],
       [0.07501876978829192, 0.2788718126409785, 0.27636012670031174,
        0.6361516259281798, 0.888389774006257],
       [0.37762640111346546, 0.8152984446241871, 0.3902714583952257,
        0.05380993554623403, 0.7206540901683921],
       ...,
       [0.21205611420393589, 0.46984296942970105, 0.4795650713351457,
        0.6554761058774242, 0.8528289678210219],
       [0.4022613575151869, 0.36843324495700924, 0.9218785822840628,
        0.5070422438836847, 0.7614330878549946],
       [0.8394586233168068, 0.1275629803119982, 0.966651663531473,
        0.504937415270063, 0.2500095811370304]], dtype=object)

In [35]:
#Transposing the dataframe
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,SLS,0.075019,0.377626,0.607906,0.196931,0.504193,0.934052,0.755619,0.521212,0.344397,...,0.841678,0.969888,0.711326,0.031885,0.197877,0.244974,0.629177,0.212056,0.402261,0.839459
1,0.029,0.278872,0.815298,0.822887,0.373406,0.934234,0.660765,0.609903,0.325479,0.422602,...,0.053703,0.661858,0.288716,0.430713,0.036241,0.973353,0.84555,0.469843,0.368433,0.127563
2,0.656206,0.27636,0.390271,0.795436,0.442572,0.68847,0.843904,0.127562,0.467396,0.002466,...,0.341759,0.069826,0.512393,0.370745,0.320529,0.179321,0.389091,0.479565,0.921879,0.966652
3,0.481254,0.636152,0.05381,0.632271,0.25156,0.198279,0.129498,0.570686,0.791626,0.79009,...,0.213009,0.77752,0.75795,0.700829,0.52777,0.879307,0.08256,0.655476,0.507042,0.504937
4,0.729363,0.88839,0.720654,0.083033,0.526525,0.729957,0.419082,0.045695,0.90354,0.195973,...,0.836027,0.708739,0.288463,0.876926,0.618714,0.439288,0.355565,0.852829,0.761433,0.25001

In [36]:
newdf.head()

          0         1         2         3         4
0       SLS  0.029000  0.656206  0.481254  0.729363
1  0.075019  0.278872  0.276360  0.636152  0.888390
2  0.377626  0.815298  0.390271  0.053810  0.720654
3  0.607906  0.822887  0.795436  0.632271  0.083033
4  0.196931  0.373406  0.442572  0.251560  0.526525

In [37]:
df1

         name  marks  city
first   harry     28  Bhkt
second    SLS    100   Ktm
third      SS     85   Ptn
fourth    Ram     40   Ktm

In [38]:
df1.marks.sum()

253

In [39]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, first to fourth
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 80.0+ bytes

In [40]:
df1.shape

(4, 3)

In [41]:
df1.size

12

In [42]:
df1.sort_values('marks')

         name  marks  city
first   harry     28  Bhkt
fourth    Ram     40   Ktm
third      SS     85   Ptn
second    SLS    100   Ktm

In [43]:
df1.sort_values('marks',ascending=False)

         name  marks  city
second    SLS    100   Ktm
third      SS     85   Ptn
fourth    Ram     40   Ktm
first   harry     28  Bhkt

In [44]:
df1.sort_index(axis=0)

         name  marks  city
first   harry     28  Bhkt
fourth    Ram     40   Ktm
second    SLS    100   Ktm
third      SS     85   Ptn

In [45]:
df1.sort_index(axis=1)

        city  marks   name
first   Bhkt     28  harry
second   Ktm    100    SLS
third    Ptn     85     SS
fourth   Ktm     40    Ram

In [46]:
newdf

            0         1         2         3         4
0         SLS  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [47]:
newdf[0][0]=1

# newdf_view=newdf creates a view so change in any of those frames gets reflected in both

In [48]:
newdf_view=newdf

In [49]:
newdf_view[0][0]=5

In [50]:
newdf

            0         1         2         3         4
0           5  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [51]:
newdf_view

            0         1         2         3         4
0           5  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

# To copy the df and use them independently

In [52]:
newdf_copy=newdf.copy()
# or we can use newdf_copy=newdf[:]

In [53]:
newdf_copy

            0         1         2         3         4
0           5  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [54]:
newdf_copy[0][0]=1

<ipython-input-54-dc14e6244eb7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf_copy[0][0]=1

In [55]:
newdf_copy

            0         1         2         3         4
0           1  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [56]:
newdf

            0         1         2         3         4
0           5  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [57]:
newdf_copy2=newdf[:]

In [58]:
newdf_copy2

            0         1         2         3         4
0           5  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [59]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [60]:
newdf

            0         1         2         3         4
0           5  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [61]:
newdf.loc[0,0]=12
#Here first 0 is row name and second 0 is column name

In [62]:
newdf

            0         1         2         3         4
0          12  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [63]:
newdf.columns= list('ABCDE')

In [64]:
newdf

            A         B         C         D         E
0          12  0.029000  0.656206  0.481254  0.729363
1    0.075019  0.278872  0.276360  0.636152  0.888390
2    0.377626  0.815298  0.390271  0.053810  0.720654
3    0.607906  0.822887  0.795436  0.632271  0.083033
4    0.196931  0.373406  0.442572  0.251560  0.526525
..        ...       ...       ...       ...       ...
329  0.244974  0.973353  0.179321  0.879307  0.439288
330  0.629177  0.845550  0.389091  0.082560  0.355565
331  0.212056  0.469843  0.479565  0.655476  0.852829
332  0.402261  0.368433  0.921879  0.507042  0.761433
333  0.839459  0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [65]:
newdf.loc[0,'B'] =100

In [66]:
newdf.head()

          A           B         C         D         E
0        12  100.000000  0.656206  0.481254  0.729363
1  0.075019    0.278872  0.276360  0.636152  0.888390
2  0.377626    0.815298  0.390271  0.053810  0.720654
3  0.607906    0.822887  0.795436  0.632271  0.083033
4  0.196931    0.373406  0.442572  0.251560  0.526525

In [67]:
newdf.loc[0,0]=1

Since there is row name 0 but no colum naming 0, newdf.loc[0,0]=1 will create new column 0

In [68]:
newdf

            A           B         C         D         E    0
0          12  100.000000  0.656206  0.481254  0.729363  1.0
1    0.075019    0.278872  0.276360  0.636152  0.888390  NaN
2    0.377626    0.815298  0.390271  0.053810  0.720654  NaN
3    0.607906    0.822887  0.795436  0.632271  0.083033  NaN
4    0.196931    0.373406  0.442572  0.251560  0.526525  NaN
..        ...         ...       ...       ...       ...  ...
329  0.244974    0.973353  0.179321  0.879307  0.439288  NaN
330  0.629177    0.845550  0.389091  0.082560  0.355565  NaN
331  0.212056    0.469843  0.479565  0.655476  0.852829  NaN
332  0.402261    0.368433  0.921879  0.507042  0.761433  NaN
333  0.839459    0.127563  0.966652  0.504937  0.250010  NaN

[334 rows x 6 columns]

In [69]:
newdf_copy=newdf.copy()

In [70]:
newdf_copy.head()

          A           B         C         D         E    0
0        12  100.000000  0.656206  0.481254  0.729363  1.0
1  0.075019    0.278872  0.276360  0.636152  0.888390  NaN
2  0.377626    0.815298  0.390271  0.053810  0.720654  NaN
3  0.607906    0.822887  0.795436  0.632271  0.083033  NaN
4  0.196931    0.373406  0.442572  0.251560  0.526525  NaN

In [71]:
newdf_copy.drop(0,axis=1).head()

          A           B         C         D         E
0        12  100.000000  0.656206  0.481254  0.729363
1  0.075019    0.278872  0.276360  0.636152  0.888390
2  0.377626    0.815298  0.390271  0.053810  0.720654
3  0.607906    0.822887  0.795436  0.632271  0.083033
4  0.196931    0.373406  0.442572  0.251560  0.526525

In [72]:
newdf_copy.drop(0,axis=0).head()
#newdf_copy.drop(0).head()

          A         B         C         D         E   0
1  0.075019  0.278872  0.276360  0.636152  0.888390 NaN
2  0.377626  0.815298  0.390271  0.053810  0.720654 NaN
3  0.607906  0.822887  0.795436  0.632271  0.083033 NaN
4  0.196931  0.373406  0.442572  0.251560  0.526525 NaN
5  0.504193  0.934234  0.688470  0.198279  0.729957 NaN

In [73]:
newdf.head()

          A           B         C         D         E    0
0        12  100.000000  0.656206  0.481254  0.729363  1.0
1  0.075019    0.278872  0.276360  0.636152  0.888390  NaN
2  0.377626    0.815298  0.390271  0.053810  0.720654  NaN
3  0.607906    0.822887  0.795436  0.632271  0.083033  NaN
4  0.196931    0.373406  0.442572  0.251560  0.526525  NaN

In [74]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.276360  0.636152
2  0.390271  0.053810

In [75]:
newdf.loc[:, ['C','D']]

            C         D
0    0.656206  0.481254
1    0.276360  0.636152
2    0.390271  0.053810
3    0.795436  0.632271
4    0.442572  0.251560
..        ...       ...
329  0.179321  0.879307
330  0.389091  0.082560
331  0.479565  0.655476
332  0.921879  0.507042
333  0.966652  0.504937

[334 rows x 2 columns]

In [76]:
newdf.loc[[1,2],:]

          A         B         C         D         E   0
1  0.075019  0.278872  0.276360  0.636152  0.888390 NaN
2  0.377626  0.815298  0.390271  0.053810  0.720654 NaN

In [77]:
newdf

            A           B         C         D         E    0
0          12  100.000000  0.656206  0.481254  0.729363  1.0
1    0.075019    0.278872  0.276360  0.636152  0.888390  NaN
2    0.377626    0.815298  0.390271  0.053810  0.720654  NaN
3    0.607906    0.822887  0.795436  0.632271  0.083033  NaN
4    0.196931    0.373406  0.442572  0.251560  0.526525  NaN
..        ...         ...       ...       ...       ...  ...
329  0.244974    0.973353  0.179321  0.879307  0.439288  NaN
330  0.629177    0.845550  0.389091  0.082560  0.355565  NaN
331  0.212056    0.469843  0.479565  0.655476  0.852829  NaN
332  0.402261    0.368433  0.921879  0.507042  0.761433  NaN
333  0.839459    0.127563  0.966652  0.504937  0.250010  NaN

[334 rows x 6 columns]

In [78]:
newdf['A']>5

0       True
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: A, Length: 334, dtype: bool

In [79]:
newdf.loc[newdf['A']>5]

    A      B         C         D         E    0
0  12  100.0  0.656206  0.481254  0.729363  1.0

In [80]:
(newdf['A']>5) & (newdf['C']<0.1)

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Length: 334, dtype: bool

In [81]:
newdf.loc[(newdf['A']>5) & (newdf['C']<0.1)]

Empty DataFrame
Columns: [A, B, C, D, E, 0]
Index: []

In [82]:
newdf.loc[(newdf['A']>5) | (newdf['C']<0.1)]

            A           B         C         D         E    0
0          12  100.000000  0.656206  0.481254  0.729363  1.0
9    0.344397    0.422602  0.002466  0.790090  0.195973  NaN
34     0.3957    0.776589  0.036707  0.886251  0.341918  NaN
47   0.516753    0.758729  0.063518  0.473648  0.994809  NaN
58   0.219943    0.044957  0.050483  0.601388  0.621513  NaN
64   0.416726    0.806783  0.061683  0.405283  0.454343  NaN
66   0.265678    0.635441  0.061057  0.522423  0.894210  NaN
76   0.830796    0.093984  0.082756  0.418325  0.855975  NaN
82   0.680441    0.565334  0.066025  0.481521  0.267069  NaN
101  0.568905    0.499886  0.001733  0.082923  0.821578  NaN
103  0.747935    0.894590  0.047465  0.736648  0.342282  NaN
119  0.696736    0.448459  0.058244  0.711044  0.670959  NaN
123  0.231692    0.142525  0.032635  0.288026  0.423818  NaN
130  0.521981    0.716362  0.007969  0.784455  0.187055  NaN
132  0.940312    0.638677  0.086125  0.703549  0.596548  NaN
157  0.459914    0.910971  0.051888  0.631027  0.601950  NaN
158  0.871514    0.237595  0.046620  0.267553  0.448976  NaN
163  0.592254    0.538992  0.080409  0.273838  0.340327  NaN
171  0.647161    0.470642  0.002389  0.937878  0.963148  NaN
172  0.474454    0.168279  0.014026  0.347976  0.727813  NaN
174  0.726131    0.841077  0.040313  0.197602  0.369832  NaN
178  0.386563    0.121815  0.088043  0.035534  0.878033  NaN
187  0.404152    0.903183  0.085694  0.085019  0.516869  NaN
201  0.630231    0.323228  0.077583  0.856810  0.872132  NaN
202   0.46276    0.658434  0.054917  0.284020  0.315926  NaN
203  0.987982    0.692232  0.046191  0.926963  0.564803  NaN
212   0.39622    0.295887  0.004635  0.200474  0.606933  NaN
221  0.136394    0.829182  0.020321  0.101290  0.290677  NaN
256  0.088009    0.693433  0.091570  0.590986  0.767344  NaN
306  0.584966    0.722804  0.085435  0.967343  0.059361  NaN
321  0.651097    0.784567  0.062717  0.119564  0.965625  NaN
325  0.969888    0.661858  0.069826  0.777520  0.708739  NaN

In [83]:
newdf.loc[(newdf['A']>5) | (newdf['C']<0.1)].shape

(32, 6)

In [84]:
newdf=newdf.drop(0, axis=1)
#inplace can be used to make effect in the given df directly
#e.g. newdf.drop(0, axis=1, inplace= True)

In [85]:
newdf

            A           B         C         D         E
0          12  100.000000  0.656206  0.481254  0.729363
1    0.075019    0.278872  0.276360  0.636152  0.888390
2    0.377626    0.815298  0.390271  0.053810  0.720654
3    0.607906    0.822887  0.795436  0.632271  0.083033
4    0.196931    0.373406  0.442572  0.251560  0.526525
..        ...         ...       ...       ...       ...
329  0.244974    0.973353  0.179321  0.879307  0.439288
330  0.629177    0.845550  0.389091  0.082560  0.355565
331  0.212056    0.469843  0.479565  0.655476  0.852829
332  0.402261    0.368433  0.921879  0.507042  0.761433
333  0.839459    0.127563  0.966652  0.504937  0.250010

[334 rows x 5 columns]

In [86]:
newdf.head(2)

          A           B         C         D         E
0        12  100.000000  0.656206  0.481254  0.729363
1  0.075019    0.278872  0.276360  0.636152  0.888390

In [87]:
newdf.iloc[0,4]
#index location

0.7293626230241204

In [88]:
newdf.loc[0,'E']
#name of rows and columns

0.7293626230241204

In [89]:
newdf.head()

          A           B         C         D         E
0        12  100.000000  0.656206  0.481254  0.729363
1  0.075019    0.278872  0.276360  0.636152  0.888390
2  0.377626    0.815298  0.390271  0.053810  0.720654
3  0.607906    0.822887  0.795436  0.632271  0.083033
4  0.196931    0.373406  0.442572  0.251560  0.526525

In [90]:
newdf.drop([1,2], axis=0, inplace=True)

In [91]:
newdf.head(2)

          A           B         C         D         E
0        12  100.000000  0.656206  0.481254  0.729363
3  0.607906    0.822887  0.795436  0.632271  0.083033

In [92]:
newdf.reset_index()

     index         A           B         C         D         E
0        0        12  100.000000  0.656206  0.481254  0.729363
1        3  0.607906    0.822887  0.795436  0.632271  0.083033
2        4  0.196931    0.373406  0.442572  0.251560  0.526525
3        5  0.504193    0.934234  0.688470  0.198279  0.729957
4        6  0.934052    0.660765  0.843904  0.129498  0.419082
..     ...       ...         ...       ...       ...       ...
327    329  0.244974    0.973353  0.179321  0.879307  0.439288
328    330  0.629177    0.845550  0.389091  0.082560  0.355565
329    331  0.212056    0.469843  0.479565  0.655476  0.852829
330    332  0.402261    0.368433  0.921879  0.507042  0.761433
331    333  0.839459    0.127563  0.966652  0.504937  0.250010

[332 rows x 6 columns]

In [93]:
newdf.reset_index(drop=True)

            A           B         C         D         E
0          12  100.000000  0.656206  0.481254  0.729363
1    0.607906    0.822887  0.795436  0.632271  0.083033
2    0.196931    0.373406  0.442572  0.251560  0.526525
3    0.504193    0.934234  0.688470  0.198279  0.729957
4    0.934052    0.660765  0.843904  0.129498  0.419082
..        ...         ...       ...       ...       ...
327  0.244974    0.973353  0.179321  0.879307  0.439288
328  0.629177    0.845550  0.389091  0.082560  0.355565
329  0.212056    0.469843  0.479565  0.655476  0.852829
330  0.402261    0.368433  0.921879  0.507042  0.761433
331  0.839459    0.127563  0.966652  0.504937  0.250010

[332 rows x 5 columns]

In [94]:
newdf.reset_index(drop=True, inplace=True)

In [95]:
newdf.head()

          A           B         C         D         E
0        12  100.000000  0.656206  0.481254  0.729363
1  0.607906    0.822887  0.795436  0.632271  0.083033
2  0.196931    0.373406  0.442572  0.251560  0.526525
3  0.504193    0.934234  0.688470  0.198279  0.729957
4  0.934052    0.660765  0.843904  0.129498  0.419082

In [96]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [97]:
 newdf.loc[newdf['B'].isnull()]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [98]:
newdf.B=None

In [99]:
newdf

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1    0.607906  None  0.795436  0.632271  0.083033
2    0.196931  None  0.442572  0.251560  0.526525
3    0.504193  None  0.688470  0.198279  0.729957
4    0.934052  None  0.843904  0.129498  0.419082
..        ...   ...       ...       ...       ...
327  0.244974  None  0.179321  0.879307  0.439288
328  0.629177  None  0.389091  0.082560  0.355565
329  0.212056  None  0.479565  0.655476  0.852829
330  0.402261  None  0.921879  0.507042  0.761433
331  0.839459  None  0.966652  0.504937  0.250010

[332 rows x 5 columns]

In [100]:
newdf.B.isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [101]:
newdf

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1    0.607906  None  0.795436  0.632271  0.083033
2    0.196931  None  0.442572  0.251560  0.526525
3    0.504193  None  0.688470  0.198279  0.729957
4    0.934052  None  0.843904  0.129498  0.419082
..        ...   ...       ...       ...       ...
327  0.244974  None  0.179321  0.879307  0.439288
328  0.629177  None  0.389091  0.082560  0.355565
329  0.212056  None  0.479565  0.655476  0.852829
330  0.402261  None  0.921879  0.507042  0.761433
331  0.839459  None  0.966652  0.504937  0.250010

[332 rows x 5 columns]

In [102]:
newdf.loc[4,'B']= 56

In [103]:
newdf.B.first_valid_index()
#Gives the index of first not null value

4

In [104]:
newdf.loc[0,:]

A          12
B        None
C    0.656206
D    0.481254
E    0.729363
Name: 0, dtype: object

In [105]:
newdf.loc[1,:]=newdf.loc[0,:]

In [106]:
newdf

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1          12  None  0.656206  0.481254  0.729363
2    0.196931  None  0.442572  0.251560  0.526525
3    0.504193  None  0.688470  0.198279  0.729957
4    0.934052    56  0.843904  0.129498  0.419082
..        ...   ...       ...       ...       ...
327  0.244974  None  0.179321  0.879307  0.439288
328  0.629177  None  0.389091  0.082560  0.355565
329  0.212056  None  0.479565  0.655476  0.852829
330  0.402261  None  0.921879  0.507042  0.761433
331  0.839459  None  0.966652  0.504937  0.250010

[332 rows x 5 columns]

In [107]:
newdf.drop_duplicates()

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
2    0.196931  None  0.442572  0.251560  0.526525
3    0.504193  None  0.688470  0.198279  0.729957
4    0.934052    56  0.843904  0.129498  0.419082
5    0.755619  None  0.127562  0.570686  0.045695
..        ...   ...       ...       ...       ...
327  0.244974  None  0.179321  0.879307  0.439288
328  0.629177  None  0.389091  0.082560  0.355565
329  0.212056  None  0.479565  0.655476  0.852829
330  0.402261  None  0.921879  0.507042  0.761433
331  0.839459  None  0.966652  0.504937  0.250010

[331 rows x 5 columns]

In [108]:
newdf=newdf.drop_duplicates()
newdf

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
2    0.196931  None  0.442572  0.251560  0.526525
3    0.504193  None  0.688470  0.198279  0.729957
4    0.934052    56  0.843904  0.129498  0.419082
5    0.755619  None  0.127562  0.570686  0.045695
..        ...   ...       ...       ...       ...
327  0.244974  None  0.179321  0.879307  0.439288
328  0.629177  None  0.389091  0.082560  0.355565
329  0.212056  None  0.479565  0.655476  0.852829
330  0.402261  None  0.921879  0.507042  0.761433
331  0.839459  None  0.966652  0.504937  0.250010

[331 rows x 5 columns]

In [109]:
newdf.reset_index(drop=True, inplace=True)

In [110]:
newdf

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1    0.196931  None  0.442572  0.251560  0.526525
2    0.504193  None  0.688470  0.198279  0.729957
3    0.934052    56  0.843904  0.129498  0.419082
4    0.755619  None  0.127562  0.570686  0.045695
..        ...   ...       ...       ...       ...
326  0.244974  None  0.179321  0.879307  0.439288
327  0.629177  None  0.389091  0.082560  0.355565
328  0.212056  None  0.479565  0.655476  0.852829
329  0.402261  None  0.921879  0.507042  0.761433
330  0.839459  None  0.966652  0.504937  0.250010

[331 rows x 5 columns]

In [111]:
newdf.drop_duplicates(['A'])

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1    0.196931  None  0.442572  0.251560  0.526525
2    0.504193  None  0.688470  0.198279  0.729957
3    0.934052    56  0.843904  0.129498  0.419082
4    0.755619  None  0.127562  0.570686  0.045695
..        ...   ...       ...       ...       ...
326  0.244974  None  0.179321  0.879307  0.439288
327  0.629177  None  0.389091  0.082560  0.355565
328  0.212056  None  0.479565  0.655476  0.852829
329  0.402261  None  0.921879  0.507042  0.761433
330  0.839459  None  0.966652  0.504937  0.250010

[331 rows x 5 columns]

In [112]:
newdf.drop_duplicates(['A'], keep='first')
#newdf.drop_duplicates(['A']) by default

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1    0.196931  None  0.442572  0.251560  0.526525
2    0.504193  None  0.688470  0.198279  0.729957
3    0.934052    56  0.843904  0.129498  0.419082
4    0.755619  None  0.127562  0.570686  0.045695
..        ...   ...       ...       ...       ...
326  0.244974  None  0.179321  0.879307  0.439288
327  0.629177  None  0.389091  0.082560  0.355565
328  0.212056  None  0.479565  0.655476  0.852829
329  0.402261  None  0.921879  0.507042  0.761433
330  0.839459  None  0.966652  0.504937  0.250010

[331 rows x 5 columns]

In [113]:
newdf.drop_duplicates(['A'], keep='last')

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1    0.196931  None  0.442572  0.251560  0.526525
2    0.504193  None  0.688470  0.198279  0.729957
3    0.934052    56  0.843904  0.129498  0.419082
4    0.755619  None  0.127562  0.570686  0.045695
..        ...   ...       ...       ...       ...
326  0.244974  None  0.179321  0.879307  0.439288
327  0.629177  None  0.389091  0.082560  0.355565
328  0.212056  None  0.479565  0.655476  0.852829
329  0.402261  None  0.921879  0.507042  0.761433
330  0.839459  None  0.966652  0.504937  0.250010

[331 rows x 5 columns]

In [114]:
newdf.drop_duplicates(['A'], keep=False)
#drop all

            A     B         C         D         E
0          12  None  0.656206  0.481254  0.729363
1    0.196931  None  0.442572  0.251560  0.526525
2    0.504193  None  0.688470  0.198279  0.729957
3    0.934052    56  0.843904  0.129498  0.419082
4    0.755619  None  0.127562  0.570686  0.045695
..        ...   ...       ...       ...       ...
326  0.244974  None  0.179321  0.879307  0.439288
327  0.629177  None  0.389091  0.082560  0.355565
328  0.212056  None  0.479565  0.655476  0.852829
329  0.402261  None  0.921879  0.507042  0.761433
330  0.839459  None  0.966652  0.504937  0.250010

[331 rows x 5 columns]

In [115]:
df1

         name  marks  city
first   harry     28  Bhkt
second    SLS    100   Ktm
third      SS     85   Ptn
fourth    Ram     40   Ktm

In [116]:
df1.count()

name     4
marks    4
city     4
dtype: int64

In [117]:
df1.name.count()

4

In [118]:
df1.name.value_counts()

harry    1
SLS      1
SS       1
Ram      1
Name: name, dtype: int64

Create a dataframe with 2 rows and 3 columns with random number from 0 to 9

In [119]:
A = np.random.randint(10, size=(2,3))

In [120]:
A

array([[1, 5, 3],
       [3, 8, 8]])

In [121]:
dfA = pd.DataFrame(A)
dfA

   0  1  2
0  1  5  3
1  3  8  8

In [122]:
dfA.mean()

0    2.0
1    6.5
2    5.5
dtype: float64

In [123]:
dfA.describe()

              0        1         2
count  2.000000  2.00000  2.000000
mean   2.000000  6.50000  5.500000
std    1.414214  2.12132  3.535534
min    1.000000  5.00000  3.000000
25%    1.500000  5.75000  4.250000
50%    2.000000  6.50000  5.500000
75%    2.500000  7.25000  6.750000
max    3.000000  8.00000  8.000000

In [124]:
dfA.corr()

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

Reading data from Excel file

In [125]:
data=pd.read_csv('data.csv')

In [126]:
data

,organisation,dataset_id,dataset_name,date_created,last_updated,description,frequency,coverage_start,coverage_end,resource_id,resource_name,resource_description,resource_format
0,National Environment Agency,0d1ace9a-baa2-46ed-b5e3-09b9dcdc60e1,2nd Hand Goods Collection Points,2015-10-20,2017-12-19,Collection points for 2nd hand goods,Annual,na,na,04cf94e2-e550-435d-9d4a-f28a04302f62,2nd Hand Goods Collection Points (KML),na,KML
1,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01,2016-12-31,c9f714db-cc3b-49ad-bb0f-302ba33505ee,Call Success Rate 2013-2016,"For period 2013 - 2016, frequency of data coll...",CSV
2,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01,2016-12-31,e9ec02c5-f3fe-49ec-960c-f7c05acf536c,Call Success Rate 2009 - 2011,"For period 2009 - 2011, frequency of data coll...",CSV
3,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01,2016-12-31,c195d04f-22d8-474f-83b8-8c2c3cb6131a,Call Success Rate 2007 - 2008,"For period 2007 - 08, frequency of data collec...",CSV
4,Infocomm Media Development Authority,e32d6a83-e791-4103-8601-3be37b2ae7e4,3G Public Cellular Mobile Telephone Services -...,2016-04-12,2017-03-28,This indicator measures the percentage of unin...,Monthly,2013-04-01,2016-06-30,b0f5648c-af96-4fee-a8fb-de7f9580d050,3G Public Cellular Mobile Telephone Services -...,na,CSV
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3142,Singapore Corporation of Rehabilitative Enterp...,4c093683-3142-4a86-a7f6-f754c1f29036,Yellow Ribbon Fund,2016-09-22,2019-01-28,The Yellow Ribbon Fund is the first and only n...,Annual,2013-01-01,2017-12-31,ff4ae4a7-c467-4232-aeb0-4e59a10aa09e,Yellow Ribbon Fund Programmes and Beneficiaries,na,CSV
3143,Singapore Corporation of Rehabilitative Enterp...,3e1fa92f-841a-4203-b390-3b3eb2d42f8f,Yellow Ribbon Project Community Partners,2016-09-22,2019-01-28,The Yellow Ribbon Project (YRP) seeks to engag...,Annual,2013-01-01,2017-12-31,b725310a-58af-4c4e-bc89-0bb51c14876c,Yellow Ribbon Project Community Partners,na,CSV
3144,Majlis Ugama Islam Singapura,725524a8-74e1-426c-85a4-59ab5b858469,Zakat Nisab Rates,2016-06-27,2017-09-22,Zakat Nisab is the minimum amount for a Muslim...,Annual,2008-01-01,2016-06-30,fd6a8afb-c552-4b84-bd9b-2b463d5605d7,Zakat Nisab Rates,Zakat Nisab is the minimum amount for a Muslim...,CSV
3145,National Environment Agency,81f14681-38ac-41f0-8c47-e7af00cf63a8,Zika Cluster,2016-09-21,2019-10-09,Active Zika Cluster In Singapore,Daily,na,na,4c3d4495-8ccb-4c38-b3f6-248d93d39628,Zika Cluster (KML),na,KML
3146,National Environment Agency,81f14681-38ac-41f0-8c47-e7af00cf63a8,Zika Cluster,2016-09-21,2019-10-09,Active Zika Cluster In Singapore,Daily,na,na,91958c70-d405-4068-8b26-c5aa92422b15,Zika Cluster (GEOJSON),na,GeoJSON

In [127]:
data.head()

,organisation,dataset_id,dataset_name,date_created,last_updated,description,frequency,coverage_start,coverage_end,resource_id,resource_name,resource_description,resource_format
0,National Environment Agency,0d1ace9a-baa2-46ed-b5e3-09b9dcdc60e1,2nd Hand Goods Collection Points,2015-10-20,2017-12-19,Collection points for 2nd hand goods,Annual,na,na,04cf94e2-e550-435d-9d4a-f28a04302f62,2nd Hand Goods Collection Points (KML),na,KML
1,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01,2016-12-31,c9f714db-cc3b-49ad-bb0f-302ba33505ee,Call Success Rate 2013-2016,"For period 2013 - 2016, frequency of data coll...",CSV
2,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01,2016-12-31,e9ec02c5-f3fe-49ec-960c-f7c05acf536c,Call Success Rate 2009 - 2011,"For period 2009 - 2011, frequency of data coll...",CSV
3,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01,2016-12-31,c195d04f-22d8-474f-83b8-8c2c3cb6131a,Call Success Rate 2007 - 2008,"For period 2007 - 08, frequency of data collec...",CSV
4,Infocomm Media Development Authority,e32d6a83-e791-4103-8601-3be37b2ae7e4,3G Public Cellular Mobile Telephone Services -...,2016-04-12,2017-03-28,This indicator measures the percentage of unin...,Monthly,2013-04-01,2016-06-30,b0f5648c-af96-4fee-a8fb-de7f9580d050,3G Public Cellular Mobile Telephone Services -...,na,CSV

Reading from Excel file

In [128]:
data1=pd.read_excel('data.xlsx')

In [129]:
data1

,Unnamed: 0,organisation,dataset_id,dataset_name,date_created,last_updated,description,frequency,coverage_start,coverage_end,resource_id,resource_name,resource_description,resource_format
0,0,National Environment Agency(NEA),0d1ace9a-baa2-46ed-b5e3-09b9dcdc60e1,2nd Hand Goods Collection Points,2015-10-20,2017-12-19,Collection points for 2nd hand goods,Annual,na,na,04cf94e2-e550-435d-9d4a-f28a04302f62,2nd Hand Goods Collection Points (KML),na,KML
1,1,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c9f714db-cc3b-49ad-bb0f-302ba33505ee,Call Success Rate 2013-2016,"For period 2013 - 2016, frequency of data coll...",EXCEL
2,2,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,e9ec02c5-f3fe-49ec-960c-f7c05acf536c,Call Success Rate 2009 - 2011,"For period 2009 - 2011, frequency of data coll...",XLS
3,3,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c195d04f-22d8-474f-83b8-8c2c3cb6131a,Call Success Rate 2007 - 2008,"For period 2007 - 08, frequency of data collec...",XLS
4,4,Infocomm Media Development Authority,e32d6a83-e791-4103-8601-3be37b2ae7e4,3G Public Cellular Mobile Telephone Services -...,2016-04-12,2017-03-28,This indicator measures the percentage of unin...,Monthly,2013-04-01 00:00:00,2016-06-30 00:00:00,b0f5648c-af96-4fee-a8fb-de7f9580d050,3G Public Cellular Mobile Telephone Services -...,na,XLS
5,5,Infocomm Media Development Authority,f2f39aa0-7e35-4edc-80d8-c2a09e2c587a,3G Public Cellular Mobile Telephone Services ...,2016-04-12,2017-03-28,This indicator measures Nation-Wide Outdoor Se...,Monthly,2013-04-01 00:00:00,2016-06-30 00:00:00,c7f2dc9d-a1b8-4fca-99fa-91a4ade199d4,3G Public Cellular Mobile Telephone Services ...,na,XLS
6,6,"PUB, Singapore's national water agency",da282d56-8660-4a7f-933d-ac5fb53be72c,ABC Waters Construction,2017-06-14,2020-01-07,The ABC Waters Construction layer represents A...,Half Year,na,na,23d492f9-7313-40fe-830d-053438e7753d,ABC Waters Construction (KML),na,KML
7,7,"PUB, Singapore's national water agency",da282d56-8660-4a7f-933d-ac5fb53be72c,ABC Waters Construction,2017-06-14,2020-01-07,The ABC Waters Construction layer represents A...,Half Year,na,na,0a096fdd-7485-4114-8d8b-2ad1d4e76dc5,ABC Waters Construction (GEOJSON),na,GeoJSON
8,8,"PUB, Singapore's national water agency",a9ce3c62-852d-424d-9471-5751c44105da,ABC Waters Sites,2016-11-09,2017-12-21,The ABC Waters Sites layer shows all the ABC W...,Half Year,na,na,67b3d4aa-dd05-49ae-8909-6100f4980fb7,ABC Waters Sites (KML),na,KML
9,9,Ministry of Home Affairs - Singapore Prison Se...,95c2dda2-cd18-44aa-bc79-923adc3380bb,Academic Programmes,2016-03-30,2019-03-29,Yearly enrolment of inmates in academic progra...,Annual,2006-01-01 00:00:00,2018-12-31 00:00:00,727694b5-2122-4096-b697-7106b5b794dd,Academic Result of Inmates,Yearly enrolment of inmates in academic progra...,XLS

There are two sheets in xls file 'data1' and 'data2'. 'data1' is first sheet which is taken by default

In [130]:
data2=pd.read_excel('data.xlsx', sheet_name='data2')

In [131]:
data2

,organisation,dataset_id,dataset_name,date_created,last_updated,description,frequency,coverage_start,coverage_end,resource_id,resource_name,resource_description,resource_format
0,National Environment Agency,0d1ace9a-baa2-46ed-b5e3-09b9dcdc60e1,2nd Hand Goods Collection Points,2015-10-20,2017-12-19,Collection points for 2nd hand goods,Annual,na,na,04cf94e2-e550-435d-9d4a-f28a04302f62,2nd Hand Goods Collection Points (KML),na,KML
1,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c9f714db-cc3b-49ad-bb0f-302ba33505ee,Call Success Rate 2013-2016,"For period 2013 - 2016, frequency of data coll...",CSV
2,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,e9ec02c5-f3fe-49ec-960c-f7c05acf536c,Call Success Rate 2009 - 2011,"For period 2009 - 2011, frequency of data coll...",CSV
3,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c195d04f-22d8-474f-83b8-8c2c3cb6131a,Call Success Rate 2007 - 2008,"For period 2007 - 08, frequency of data collec...",CSV
4,Infocomm Media Development Authority,e32d6a83-e791-4103-8601-3be37b2ae7e4,3G Public Cellular Mobile Telephone Services -...,2016-04-12,2017-03-28,This indicator measures the percentage of unin...,Monthly,2013-04-01 00:00:00,2016-06-30 00:00:00,b0f5648c-af96-4fee-a8fb-de7f9580d050,3G Public Cellular Mobile Telephone Services -...,na,CSV
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3142,Singapore Corporation of Rehabilitative Enterp...,4c093683-3142-4a86-a7f6-f754c1f29036,Yellow Ribbon Fund,2016-09-22,2019-01-28,The Yellow Ribbon Fund is the first and only n...,Annual,2013-01-01 00:00:00,2017-12-31 00:00:00,ff4ae4a7-c467-4232-aeb0-4e59a10aa09e,Yellow Ribbon Fund Programmes and Beneficiaries,na,CSV
3143,Singapore Corporation of Rehabilitative Enterp...,3e1fa92f-841a-4203-b390-3b3eb2d42f8f,Yellow Ribbon Project Community Partners,2016-09-22,2019-01-28,The Yellow Ribbon Project (YRP) seeks to engag...,Annual,2013-01-01 00:00:00,2017-12-31 00:00:00,b725310a-58af-4c4e-bc89-0bb51c14876c,Yellow Ribbon Project Community Partners,na,CSV
3144,Majlis Ugama Islam Singapura,725524a8-74e1-426c-85a4-59ab5b858469,Zakat Nisab Rates,2016-06-27,2017-09-22,Zakat Nisab is the minimum amount for a Muslim...,Annual,2008-01-01 00:00:00,2016-06-30 00:00:00,fd6a8afb-c552-4b84-bd9b-2b463d5605d7,Zakat Nisab Rates,Zakat Nisab is the minimum amount for a Muslim...,CSV
3145,National Environment Agency,81f14681-38ac-41f0-8c47-e7af00cf63a8,Zika Cluster,2016-09-21,2019-10-09,Active Zika Cluster In Singapore,Daily,na,na,4c3d4495-8ccb-4c38-b3f6-248d93d39628,Zika Cluster (KML),na,KML
3146,National Environment Agency,81f14681-38ac-41f0-8c47-e7af00cf63a8,Zika Cluster,2016-09-21,2019-10-09,Active Zika Cluster In Singapore,Daily,na,na,91958c70-d405-4068-8b26-c5aa92422b15,Zika Cluster (GEOJSON),na,GeoJSON

In [132]:
data1

,Unnamed: 0,organisation,dataset_id,dataset_name,date_created,last_updated,description,frequency,coverage_start,coverage_end,resource_id,resource_name,resource_description,resource_format
0,0,National Environment Agency(NEA),0d1ace9a-baa2-46ed-b5e3-09b9dcdc60e1,2nd Hand Goods Collection Points,2015-10-20,2017-12-19,Collection points for 2nd hand goods,Annual,na,na,04cf94e2-e550-435d-9d4a-f28a04302f62,2nd Hand Goods Collection Points (KML),na,KML
1,1,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c9f714db-cc3b-49ad-bb0f-302ba33505ee,Call Success Rate 2013-2016,"For period 2013 - 2016, frequency of data coll...",EXCEL
2,2,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,e9ec02c5-f3fe-49ec-960c-f7c05acf536c,Call Success Rate 2009 - 2011,"For period 2009 - 2011, frequency of data coll...",XLS
3,3,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c195d04f-22d8-474f-83b8-8c2c3cb6131a,Call Success Rate 2007 - 2008,"For period 2007 - 08, frequency of data collec...",XLS
4,4,Infocomm Media Development Authority,e32d6a83-e791-4103-8601-3be37b2ae7e4,3G Public Cellular Mobile Telephone Services -...,2016-04-12,2017-03-28,This indicator measures the percentage of unin...,Monthly,2013-04-01 00:00:00,2016-06-30 00:00:00,b0f5648c-af96-4fee-a8fb-de7f9580d050,3G Public Cellular Mobile Telephone Services -...,na,XLS
5,5,Infocomm Media Development Authority,f2f39aa0-7e35-4edc-80d8-c2a09e2c587a,3G Public Cellular Mobile Telephone Services ...,2016-04-12,2017-03-28,This indicator measures Nation-Wide Outdoor Se...,Monthly,2013-04-01 00:00:00,2016-06-30 00:00:00,c7f2dc9d-a1b8-4fca-99fa-91a4ade199d4,3G Public Cellular Mobile Telephone Services ...,na,XLS
6,6,"PUB, Singapore's national water agency",da282d56-8660-4a7f-933d-ac5fb53be72c,ABC Waters Construction,2017-06-14,2020-01-07,The ABC Waters Construction layer represents A...,Half Year,na,na,23d492f9-7313-40fe-830d-053438e7753d,ABC Waters Construction (KML),na,KML
7,7,"PUB, Singapore's national water agency",da282d56-8660-4a7f-933d-ac5fb53be72c,ABC Waters Construction,2017-06-14,2020-01-07,The ABC Waters Construction layer represents A...,Half Year,na,na,0a096fdd-7485-4114-8d8b-2ad1d4e76dc5,ABC Waters Construction (GEOJSON),na,GeoJSON
8,8,"PUB, Singapore's national water agency",a9ce3c62-852d-424d-9471-5751c44105da,ABC Waters Sites,2016-11-09,2017-12-21,The ABC Waters Sites layer shows all the ABC W...,Half Year,na,na,67b3d4aa-dd05-49ae-8909-6100f4980fb7,ABC Waters Sites (KML),na,KML
9,9,Ministry of Home Affairs - Singapore Prison Se...,95c2dda2-cd18-44aa-bc79-923adc3380bb,Academic Programmes,2016-03-30,2019-03-29,Yearly enrolment of inmates in academic progra...,Annual,2006-01-01 00:00:00,2018-12-31 00:00:00,727694b5-2122-4096-b697-7106b5b794dd,Academic Result of Inmates,Yearly enrolment of inmates in academic progra...,XLS

In [133]:
data1.iloc[0,0]='National Environment Agency(NEA)'

In [134]:
data1

,Unnamed: 0,organisation,dataset_id,dataset_name,date_created,last_updated,description,frequency,coverage_start,coverage_end,resource_id,resource_name,resource_description,resource_format
0,National Environment Agency(NEA),National Environment Agency(NEA),0d1ace9a-baa2-46ed-b5e3-09b9dcdc60e1,2nd Hand Goods Collection Points,2015-10-20,2017-12-19,Collection points for 2nd hand goods,Annual,na,na,04cf94e2-e550-435d-9d4a-f28a04302f62,2nd Hand Goods Collection Points (KML),na,KML
1,1,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c9f714db-cc3b-49ad-bb0f-302ba33505ee,Call Success Rate 2013-2016,"For period 2013 - 2016, frequency of data coll...",EXCEL
2,2,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,e9ec02c5-f3fe-49ec-960c-f7c05acf536c,Call Success Rate 2009 - 2011,"For period 2009 - 2011, frequency of data coll...",XLS
3,3,Infocomm Media Development Authority,6ed1bad5-0051-45e1-8619-0eab2a241e1a,3G Public Cellular Mobile Telephone Services -...,2015-09-15,2017-03-28,Cellular mobile call success rates from 2007 -...,Monthly,2013-04-01 00:00:00,2016-12-31 00:00:00,c195d04f-22d8-474f-83b8-8c2c3cb6131a,Call Success Rate 2007 - 2008,"For period 2007 - 08, frequency of data collec...",XLS
4,4,Infocomm Media Development Authority,e32d6a83-e791-4103-8601-3be37b2ae7e4,3G Public Cellular Mobile Telephone Services -...,2016-04-12,2017-03-28,This indicator measures the percentage of unin...,Monthly,2013-04-01 00:00:00,2016-06-30 00:00:00,b0f5648c-af96-4fee-a8fb-de7f9580d050,3G Public Cellular Mobile Telephone Services -...,na,XLS
5,5,Infocomm Media Development Authority,f2f39aa0-7e35-4edc-80d8-c2a09e2c587a,3G Public Cellular Mobile Telephone Services ...,2016-04-12,2017-03-28,This indicator measures Nation-Wide Outdoor Se...,Monthly,2013-04-01 00:00:00,2016-06-30 00:00:00,c7f2dc9d-a1b8-4fca-99fa-91a4ade199d4,3G Public Cellular Mobile Telephone Services ...,na,XLS
6,6,"PUB, Singapore's national water agency",da282d56-8660-4a7f-933d-ac5fb53be72c,ABC Waters Construction,2017-06-14,2020-01-07,The ABC Waters Construction layer represents A...,Half Year,na,na,23d492f9-7313-40fe-830d-053438e7753d,ABC Waters Construction (KML),na,KML
7,7,"PUB, Singapore's national water agency",da282d56-8660-4a7f-933d-ac5fb53be72c,ABC Waters Construction,2017-06-14,2020-01-07,The ABC Waters Construction layer represents A...,Half Year,na,na,0a096fdd-7485-4114-8d8b-2ad1d4e76dc5,ABC Waters Construction (GEOJSON),na,GeoJSON
8,8,"PUB, Singapore's national water agency",a9ce3c62-852d-424d-9471-5751c44105da,ABC Waters Sites,2016-11-09,2017-12-21,The ABC Waters Sites layer shows all the ABC W...,Half Year,na,na,67b3d4aa-dd05-49ae-8909-6100f4980fb7,ABC Waters Sites (KML),na,KML
9,9,Ministry of Home Affairs - Singapore Prison Se...,95c2dda2-cd18-44aa-bc79-923adc3380bb,Academic Programmes,2016-03-30,2019-03-29,Yearly enrolment of inmates in academic progra...,Annual,2006-01-01 00:00:00,2018-12-31 00:00:00,727694b5-2122-4096-b697-7106b5b794dd,Academic Result of Inmates,Yearly enrolment of inmates in academic progra...,XLS

In [135]:
data1.to_excel('datawrite.xlsx',sheet_name='data1')
#It overwrites the file if available else creates new file